def process_bank_search(data:list[dict], search:str)->list[dict]:
    """
    функцию, которая принимает список словарей с данными о банковских операциях и строку поиска,
    а возвращает список словарей, у которых в описании есть данная строка
    :param data:список словарей с данными о банковских операциях
    :param search: строка поиска
    :return:список словарей, у которых в описании есть данная строка
    """
    pass


def process_bank_operations(data:list[dict], categories:list)->dict
    """
    функцию, которая принимает список словарей с данными о банковских операциях и список категорий операций,
    возвращает словарь, в котором ключи — это названия категорий, а значения — это количество операций в каждой
    категории.
    :param data:список словарей с данными о банковских операциях
    :param search: строка поиска
    :return: словарь, в котором ключи — это названия категорий, а значения — это количество операций в каждой
    категории.
    """


    pass
